app/controllers/posts_controller.rb

	def update
		indv_post
		@post.update(title: params[:title], description: params[:description])
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Rails Introduction is right on!"], ["description", "This got edit to on the real"], ["updated_at", "2016-12-26 03:51:37.209126"], ["id", 1]]